<?php

namespace FortuneTelling\data;

class LunarDb
{
    public const LUNAR_INFO = [
        [0, 2, 9, 21936], [6, 1, 30, 9656], [0, 2, 17, 9584], [0, 2, 6, 21168], [5, 1, 26, 43344], [0, 2, 13, 59728],
        [0, 2, 2, 27296], [3, 1, 22, 44368], [0, 2, 10, 43856], [8, 1, 30, 19304], [0, 2, 19, 19168], [0, 2, 8, 42352],
        [5, 1, 29, 21096], [0, 2, 16, 53856], [0, 2, 4, 55632], [4, 1, 25, 27304], [0, 2, 13, 22176], [0, 2, 2, 39632],
        [2, 1, 22, 19176], [0, 2, 10, 19168], [6, 1, 30, 42200], [0, 2, 18, 42192], [0, 2, 6, 53840], [5, 1, 26, 54568],
        [0, 2, 14, 46400], [0, 2, 3, 54944], [2, 1, 23, 38608], [0, 2, 11, 38320], [7, 2, 1, 18872], [0, 2, 20, 18800],
        [0, 2, 8, 42160], [5, 1, 28, 45656], [0, 2, 16, 27216], [0, 2, 5, 27968], [4, 1, 24, 44456], [0, 2, 13, 11104],
        [0, 2, 2, 38256], [2, 1, 23, 18808], [0, 2, 10, 18800], [6, 1, 30, 25776], [0, 2, 17, 54432], [0, 2, 6, 59984],
        [5, 1, 26, 27976], [0, 2, 14, 23248], [0, 2, 4, 11104], [3, 1, 24, 37744], [0, 2, 11, 37600], [7, 1, 31, 51560],
        [0, 2, 19, 51536], [0, 2, 8, 54432], [6, 1, 27, 55888], [0, 2, 15, 46416], [0, 2, 5, 22176], [4, 1, 25, 43736],
        [0, 2, 13, 9680], [0, 2, 2, 37584], [2, 1, 22, 51544], [0, 2, 10, 43344], [7, 1, 29, 46248], [0, 2, 17, 27808],
        [0, 2, 6, 46416], [5, 1, 27, 21928], [0, 2, 14, 19872], [0, 2, 3, 42416], [3, 1, 24, 21176], [0, 2, 12, 21168],
        [8, 1, 31, 43344], [0, 2, 18, 59728], [0, 2, 8, 27296], [6, 1, 28, 44368], [0, 2, 15, 43856], [0, 2, 5, 19296],
        [4, 1, 25, 42352], [0, 2, 13, 42352], [0, 2, 2, 21088], [3, 1, 21, 59696], [0, 2, 9, 55632], [7, 1, 30, 23208],
        [0, 2, 17, 22176], [0, 2, 6, 38608], [5, 1, 27, 19176], [0, 2, 15, 19152], [0, 2, 3, 42192], [4, 1, 23, 53864],
        [0, 2, 11, 53840], [8, 1, 31, 54568], [0, 2, 18, 46400], [0, 2, 7, 46752], [6, 1, 28, 38608], [0, 2, 16, 38320],
        [0, 2, 5, 18864], [4, 1, 25, 42168], [0, 2, 13, 42160], [10, 2, 2, 45656], [0, 2, 20, 27216], [0, 2, 9, 27968],
        [6, 1, 29, 44448], [0, 2, 17, 43872], [0, 2, 6, 38256], [5, 1, 27, 18808], [0, 2, 15, 18800], [0, 2, 4, 25776],
        [3, 1, 23, 27216], [0, 2, 10, 59984], [8, 1, 31, 27432], [0, 2, 19, 23232], [0, 2, 7, 43872], [5, 1, 28, 37736],
        [0, 2, 16, 37600], [0, 2, 5, 51552], [4, 1, 24, 54440], [0, 2, 12, 54432], [0, 2, 1, 55888], [2, 1, 22, 23208],
        [0, 2, 9, 22176], [7, 1, 29, 43736], [0, 2, 18, 9680], [0, 2, 7, 37584], [5, 1, 26, 51544], [0, 2, 14, 43344],
        [0, 2, 3, 46240], [4, 1, 23, 46416], [0, 2, 10, 44368], [9, 1, 31, 21928], [0, 2, 19, 19360], [0, 2, 8, 42416],
        [6, 1, 28, 21176], [0, 2, 16, 21168], [0, 2, 5, 43312], [4, 1, 25, 29864], [0, 2, 12, 27296], [0, 2, 1, 44368],
        [2, 1, 22, 19880], [0, 2, 10, 19296], [6, 1, 29, 42352], [0, 2, 17, 42208], [0, 2, 6, 53856], [5, 1, 26, 59696],
        [0, 2, 13, 54576], [0, 2, 3, 23200], [3, 1, 23, 27472], [0, 2, 11, 38608], [11, 1, 31, 19176], [0, 2, 19, 19152],
        [0, 2, 8, 42192], [6, 1, 28, 53848], [0, 2, 15, 53840], [0, 2, 4, 54560], [5, 1, 24, 55968], [0, 2, 12, 46496],
        [0, 2, 1, 22224], [2, 1, 22, 19160], [0, 2, 10, 18864], [7, 1, 30, 42168], [0, 2, 17, 42160], [0, 2, 6, 43600],
        [5, 1, 26, 46376], [0, 2, 14, 27936], [0, 2, 2, 44448], [3, 1, 23, 21936], [0, 2, 11, 37744], [8, 2, 1, 18808],
        [0, 2, 19, 18800], [0, 2, 8, 25776], [6, 1, 28, 27216], [0, 2, 15, 59984], [0, 2, 4, 27424], [4, 1, 24, 43872],
        [0, 2, 12, 43744], [0, 2, 2, 37600], [3, 1, 21, 51568], [0, 2, 9, 51552], [7, 1, 29, 54440], [0, 2, 17, 54432],
        [0, 2, 5, 55888], [5, 1, 26, 23208], [0, 2, 14, 22176], [0, 2, 3, 42704], [4, 1, 23, 21224], [0, 2, 11, 21200],
        [8, 1, 31, 43352], [0, 2, 19, 43344], [0, 2, 7, 46240], [6, 1, 27, 46416], [0, 2, 15, 44368], [0, 2, 5, 21920],
        [4, 1, 24, 42448], [0, 2, 12, 42416], [0, 2, 2, 21168], [3, 1, 22, 43320], [0, 2, 9, 26928], [7, 1, 29, 29336],
        [0, 2, 17, 27296], [0, 2, 6, 44368], [5, 1, 26, 19880], [0, 2, 14, 19296], [0, 2, 3, 42352], [4, 1, 24, 21104],
        [0, 2, 10, 53856], [8, 1, 30, 59696], [0, 2, 18, 54560], [0, 2, 7, 55968], [6, 1, 27, 27472], [0, 2, 15, 22224],
        [0, 2, 5, 19168], [4, 1, 25, 42216], [0, 2, 12, 42192], [0, 2, 1, 53584], [2, 1, 21, 55592], [0, 2, 9, 54560]
    ];
    public const MONTH_DAYS = [31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
    public const DEFAULT_DATE = [1891, '正月', '初一', '辛卯', 1, 1, '兔',0];
    public const SKY = ['庚', '辛', '壬', '癸', '甲', '乙', '丙', '丁', '戊', '己'];
    public const EARTH = ['申', '酉', '戌', '亥', '子', '丑', '寅', '卯', '辰', '巳', '午', '未'];
    public const ZODIAC = ['猴', '鸡', '狗', '猪', '鼠', '牛', '虎', '兔', '龙', '蛇', '马', '羊'];
    public const DATE_HASH = ['十', '一', '二', '三', '四', '五', '六', '七', '八', '九'];
    public const TEN_DATE_HASH = ['初', '十', '廿'];
    public const MONTH_HASH = ['正月', '二月', '三月', '四月', '五月', '六月', '七月', '八月', '九月', '十月', '冬月', '腊月'];
    public const JIE_QI_DETAIL = [
        0 => [
            "name" => "小寒",
            "nameEn" => "Lesser Cold",
            "month" => 1,
            'dzNum' => 12,
            'c' => [
                20 => 6.11,
                21 => 5.4055
            ],
            'diff' => [
                1982 => 1,
                2019 => -1,
            ],
            "sanHou" => "雁北向、鹊始巢、雉始雊。",
            "content" => "太阳黄经为285°。小寒以后，开始进入寒冷季节。冷气积久而寒，小寒是天气寒冷但还没有到极点的意思。"
        ],
        1 => [
            "name" => "立春",
            "nameEn" => "the Beginning of Spring",
            "month" => 2,
            'dzNum' => 1,
            'c' => [
                20 => 4.2685,
                21 => 3.87
            ],
            'diff' => [],
            "sanHou" => "东风解冻、蛰虫始振、鱼上冰。",
            "content" => "斗指东北。太阳黄经为315度。是二十四个节气的头一个节气。其含意是开始进入春天，“阳和起蛰，品物皆春”，过了立春，万物复苏生机勃勃，一年四季从此开始了。"
        ],
        2 => [
            "name" => "惊蛰",
            "nameEn" => "the Waking of Insects",
            "month" => 3,
            'dzNum' => 2,
            'c' => [
                20 => 6.3826,
                21 => 5.63
            ],
            'diff' => [],
            "sanHou" => "桃始花、仓庚鸣、鹰化为鸠。",
            "content" => "斗指丁。太阳黄经为345°。这个节气表示“立春”以后天气转暖，春雷开始震响，蛰伏在泥土里的各种冬眠动物将苏醒过来开始活动起来，所以叫惊蛰。这个时期过冬的虫排卵也要开始孵化。我国部分地区过入了春耕季节。谚语云：“惊蛰过，暖和和，蛤蟆老角唱山歌。”“惊蛰一犁土，春分地气通。”“惊蛰没到雷先鸣，大雨似蛟龙。"
        ],
        3 => [
            "name" => "清明",
            "nameEn" => "Pure Brightness",
            "month" => 4,
            'dzNum' => 3,
            'c' => [
                20 => 5.59,
                21 => 4.81
            ],
            'diff' => [],
            "sanHou" => "桐始华、鼠化为鴽、虹始见。",
            "content" => "斗指丁。太阳黄经为15°。此时气候清爽温暖，草木始发新枝芽，万物开始生长，农民忙于春耕春种。从前，在清明节这一天，有些人家都在门口插上杨柳条，还到郊外踏青，祭扫坟墓，这是古老的习俗。"
        ],
        4 => [
            "name" => "立夏",
            "nameEn" => "the Beginning of Summer",
            "month" => 5,
            'dzNum' => 4,
            'c' => [
                20 => 6.318,
                21 => 5.52
            ],
            'diff' => [
                1911 => 1
            ],
            "sanHou" => "蝼蝈鸣、蚯蚓出、王瓜生。",
            "content" => "斗指东南。太阳黄经为45°。是夏季的开始，从此进入夏天，万物旺盛大。习惯上把立夏当作是气温显著升高，炎暑将临，雷雨增多，农作物进入旺季生长的一个最重要节气。"
        ],
        5 => [
            "name" => "芒种",
            "nameEn" => "Grain in Beard",
            "month" => 6,
            'dzNum' => 5,
            'c' => [
                20 => 6.5,
                21 => 5.678
            ],
            'diff' => [
                1902 => 1
            ],
            "sanHou" => "螳螂生、鵙始鸣、反舌无声。",
            "content" => "北斗指向已。太阳黄经为75°。这时最适合播种有芒的谷类作物，如晚谷、黍、稷等。如过了这个时候再种有芒和作物就不好成熟了。同时，“芒”指有芒作物如小麦、大麦等，“种”指种子。芒种即表明小麦等有芒作物成熟。芒种前后，我国中部的长江中、下游地区，雨量增多，气温升高，进入连绵阴雨的梅雨季节，空气非常潮湿，天气异常闷热，各种器具和衣物容易发霉，所以在我国长江中、下游地区也叫“霉雨”。"
        ],
        6 => [
            "name" => "小暑",
            "nameEn" => "Lesser Heat",
            "month" => 7,
            'dzNum' => 6,
            'c' => [
                20 => 7.928,
                21 => 7.108
            ],
            'diff' => [
                1925 => 1,
                2016 => 1,
            ],
            "sanHou" => "温风至、蟋蟀居辟、鹰乃学习。",
            "content" => "斗指辛。太阳黄经为105°。天气已经很热，但不到是热的时候，所以叫小暑。此时，已是初伏前后。"
        ],
        7 => [
            "name" => "立秋",
            "nameEn" => "the Beginning of Autumn",
            "month" => 8,
            'dzNum' => 7,
            'c' => [
                20 => 8.35,
                21 => 7.5
            ],
            'diff' => [
                2022 => 1
            ],
            "sanHou" => "凉风至、白露降、寒蝉鸣。",
            "content" => "北斗指向西南。太阳黄经为135°。从这一天起秋天开始，秋高气爽，月明风清。此后，气温由最热逐渐下降。"
        ],
        8 => [
            "name" => "白露",
            "nameEn" => "White Dew",
            "month" => 9,
            'dzNum' => 8,
            'c' => [
                20 => 8.44,
                21 => 7.646
            ],
            'diff' => [
                1927 => 1
            ],
            "sanHou" => "鸿雁来、玄鸟归、群鸟养羞。",
            "content" => "斗指癸。太阳黄经为165°。天气转凉，地面水汽结露最多。"
        ],
        9 => [
            "name" => "寒露",
            "nameEn" => "Cold Dew",
            "month" => 10,
            'dzNum' => 9,
            'c' => [
                20 => 9.098,
                21 => 8.318
            ],
            'diff' => [],
            "sanHou" => "鸿雁来宾、雀攻大水为蛤、菊有黄花。",
            "content" => "斗指甲。太阳黄经为195°。白露后，天气转凉，开始出现露水，到了寒露，则露水日多，且气温更低了。所以，有人说，寒是露之气，先白而后寒，是气候将逐渐转冷的意思。而水气则凝成白色露珠。"
        ],
        10 => [
            "name" => "立冬",
            "nameEn" => "the Beginning of Winter",
            "month" => 11,
            'dzNum' => 10,
            'c' => [
                20 => 8.218,
                21 => 7.438
            ],
            'diff' => [
                2089 => 1
            ],
            "sanHou" => "水始冰、地始冻、雉入大水为蜃。",
            "content" => "太阳黄经为225°。习惯上，我国人民把这一天当作冬季的开始。冬，作为终了之意，是指一年的田间操作结束了，作物收割之后要收藏起来的意思。立冬一过，我国黄河中、下游地区即将结冰，我国各地农民都将陆续地转入农田水利基本建设和其他农事活动中。"
        ],
        11 => [
            "name" => "大雪",
            "nameEn" => "Greater Snow",
            "month" => 12,
            'dzNum' => 11,
            'c' => [
                20 => 7.9,
                21 => 7.18
            ],
            'diff' => [
                1954 => 1
            ],
            "sanHou" => "鴠鸟不鸣、虎始交、荔挺生。",
            "content" => "太阳黄经为255°。大雪前后，黄河流域一带渐有积雪；而北方，已是“千里冰封，万里雪飘荡”的严冬了。"
        ],
    ];
    public const JIE_QI_DETAIL_24 = [
        0 => [
            "name" => "小寒",
            "nameEn" => "Lesser Cold",
            "month" => 1,
            'c' => [
                20 => 6.11,
                21 => 5.4055
            ],
            'diff' => [
                1982 => 1,
                2019 => -1,
            ],
            "sanHou" => "雁北向、鹊始巢、雉始雊。",
            "content" => "太阳黄经为285°。小寒以后，开始进入寒冷季节。冷气积久而寒，小寒是天气寒冷但还没有到极点的意思。"
        ],
        1 => [
            "name" => "大寒",
            "nameEn" => "Greater Cold",
            "month" => 1,
            'c' => [
                20 => 20.84,
                21 => 20.12
            ],
            'diff' => [
                2000 => 1,
                2082 => 1
            ],
            "sanHou" => "鸡始乳、鸷鸟厉疾、水泽腹坚。",
            "content" => "太阳黄经为300°。大寒就是天气寒冷到了极点的意思。大寒前后是一年中最冷的季节。大寒正值三九刚过，四九之初。谚云：“三九四九冰上走”。 "
        ],
        2 => [
            "name" => "立春",
            "nameEn" => "the Beginning of Spring",
            "month" => 2,
            'c' => [
                20 => 4.2685,
                21 => 3.87
            ],
            'diff' => [],
            "sanHou" => "东风解冻、蛰虫始振、鱼上冰。",
            "content" => "斗指东北。太阳黄经为315度。是二十四个节气的头一个节气。其含意是开始进入春天，“阳和起蛰，品物皆春”，过了立春，万物复苏生机勃勃，一年四季从此开始了。"
        ],
        3 => [
            "name" => "雨水",
            "nameEn" => "Rain Water",
            "month" => 2,
            'c' => [
                20 => 19.4599,
                21 => 18.73
            ],
            'diff' => [
                2026 => -1
            ],
            "sanHou" => "獭祭鱼、鸿雁来、草木萌动。",
            "content" => "斗指壬。太阳黄经为330°。这时春风遍吹，冰雪融化，空气湿润，雨水增多，所以叫雨水。人们常说：“立春天渐暖，雨水送肥忙”。"
        ],
        4 => [
            "name" => "惊蛰",
            "nameEn" => "the Waking of Insects",
            "month" => 3,
            'c' => [
                20 => 6.3826,
                21 => 5.63
            ],
            'diff' => [],
            "sanHou" => "桃始花、仓庚鸣、鹰化为鸠。",
            "content" => "斗指丁。太阳黄经为345°。这个节气表示“立春”以后天气转暖，春雷开始震响，蛰伏在泥土里的各种冬眠动物将苏醒过来开始活动起来，所以叫惊蛰。这个时期过冬的虫排卵也要开始孵化。我国部分地区过入了春耕季节。谚语云：“惊蛰过，暖和和，蛤蟆老角唱山歌。”“惊蛰一犁土，春分地气通。”“惊蛰没到雷先鸣，大雨似蛟龙。"
        ],
        5 => [
            "name" => "春分",
            "nameEn" => "the Spring Equinox",
            "month" => 3,
            'c' => [
                20 => 21.4155,
                21 => 20.646
            ],
            'diff' => [
                2084 => 1
            ],
            "sanHou" => "玄鸟至、雷乃发声、始电。",
            "content" => "斗指壬。太阳黄经为0°。春分日太阳在赤道上方。这是春季90天的中分点，这一天南北两半球昼夜相等，所以叫春分。这天以后太阳直射位置便向北移，北半球昼长夜短。所以春分是北半球春季开始。我国大部分地区越冬作物进入春季生长阶段。各地农谚有：“春分在前，斗米斗钱”（广东）、“春分甲子雨绵绵，夏分甲子火烧天”（四川）、“春分有雨家家忙，先种瓜豆后插秧”（湖北）、“春分种菜，大暑摘瓜”（湖南）、“春分种麻种豆，秋分种麦种蒜”（安徽）。 "
        ],
        6 => [
            "name" => "清明",
            "nameEn" => "Pure Brightness",
            "month" => 4,
            'c' => [
                20 => 5.59,
                21 => 4.81
            ],
            'diff' => [],
            "sanHou" => "桐始华、鼠化为鴽、虹始见。",
            "content" => "斗指丁。太阳黄经为15°。此时气候清爽温暖，草木始发新枝芽，万物开始生长，农民忙于春耕春种。从前，在清明节这一天，有些人家都在门口插上杨柳条，还到郊外踏青，祭扫坟墓，这是古老的习俗。"
        ],
        7 => [
            "name" => "谷雨",
            "nameEn" => "Grain Rain",
            "month" => 4,
            'c' => [
                20 => 20.888,
                21 => 20.1
            ],
            'diff' => [],
            "sanHou" => "萍始生、鸣鸠拂其羽、戴胜降于桑。",
            "content" => "斗指癸。太阳黄经为30°。就是雨水生五谷的意思，由于雨水滋润大地五谷得以生长，所以，谷雨就是“雨生百谷”。谚云“谷雨前后，种瓜种豆”。 "
        ],
        8 => [
            "name" => "立夏",
            "nameEn" => "the Beginning of Summer",
            "month" => 5,
            'c' => [
                20 => 6.318,
                21 => 5.52
            ],
            'diff' => [
                1911 => 1
            ],
            "sanHou" => "蝼蝈鸣、蚯蚓出、王瓜生。",
            "content" => "斗指东南。太阳黄经为45°。是夏季的开始，从此进入夏天，万物旺盛大。习惯上把立夏当作是气温显著升高，炎暑将临，雷雨增多，农作物进入旺季生长的一个最重要节气。"
        ],
        9 => [
            "name" => "小满",
            "nameEn" => "Lesser Fullness of Grain",
            "month" => 5,
            'c' => [
                20 => 21.86,
                21 => 21.04
            ],
            'diff' => [
                2008 => 1
            ],
            "sanHou" => "苦菜秀、靡草死、小暑至。",
            "content" => "斗指甲。太阳黄经为60°。从小满开始，大麦、冬小麦等夏收作物，已经结果、籽粒饱满，但尚未成熟，所以叫小满。"
        ],
        10 => [
            "name" => "芒种",
            "nameEn" => "Grain in Beard",
            "month" => 6,
            'c' => [
                20 => 6.5,
                21 => 5.678
            ],
            'diff' => [
                1902 => 1
            ],
            "sanHou" => "螳螂生、鵙始鸣、反舌无声。",
            "content" => "北斗指向已。太阳黄经为75°。这时最适合播种有芒的谷类作物，如晚谷、黍、稷等。如过了这个时候再种有芒和作物就不好成熟了。同时，“芒”指有芒作物如小麦、大麦等，“种”指种子。芒种即表明小麦等有芒作物成熟。芒种前后，我国中部的长江中、下游地区，雨量增多，气温升高，进入连绵阴雨的梅雨季节，空气非常潮湿，天气异常闷热，各种器具和衣物容易发霉，所以在我国长江中、下游地区也叫“霉雨”。"
        ],
        11 => [
            "name" => "夏至",
            "nameEn" => "the Summer Solstice",
            "month" => 6,
            'c' => [
                20 => 22.2,
                21 => 21.37
            ],
            'diff' => [
                1928 => 1
            ],
            "sanHou" => "鹿角解、蜩始鸣、半夏生。",
            "content" => "北斗指向乙。太阳黄经为90°。太阳在黄经90°“夏至点”时，阳光几乎直射北回归线上空，北半球正午太阳最高。这一天是北半球白昼最长、黑夜最短的一天，从这一天起，进入炎热季节，天地万物在此时生长最旺盛。所心以古时候又把这一天叫做日北至，意思是太阳运生到最北的一日。过了夏至，太阳逐渐向南移动，北半球白昼一天比一天缩短，黑夜一天比一天加长。"
        ],
        12 => [
            "name" => "小暑",
            "nameEn" => "Lesser Heat",
            "month" => 7,
            'c' => [
                20 => 7.928,
                21 => 7.108
            ],
            'diff' => [
                1925 => 1,
                2016 => 1,
            ],
            "sanHou" => "温风至、蟋蟀居辟、鹰乃学习。",
            "content" => "斗指辛。太阳黄经为105°。天气已经很热，但不到是热的时候，所以叫小暑。此时，已是初伏前后。"
        ],
        13 => [
            "name" => "大暑",
            "nameEn" => "Greater Heat ",
            "month" => 7,
            'c' => [
                20 => 23.65,
                21 => 22.83
            ],
            'diff' => [
                1922 => 1
            ],
            "sanHou" => "腐草化为萤、土润溽暑、大雨时行。",
            "content" => "斗指丙。太阳黄经为120°。大暑是一年中最热的节气，正值勤二伏前后，长江流域的许多地方，经常出现40℃高温天气。要作好防暑降温工作。这个节气雨水多，在“小暑、大暑，淹死老鼠”的谚语，要注意防汛防涝。"
        ],
        14 => [
            "name" => "立秋",
            "nameEn" => "the Beginning of Autumn",
            "month" => 8,
            'c' => [
                20 => 8.35,
                21 => 7.5
            ],
            'diff' => [
                2022 => 1
            ],
            "sanHou" => "凉风至、白露降、寒蝉鸣。",
            "content" => "北斗指向西南。太阳黄经为135°。从这一天起秋天开始，秋高气爽，月明风清。此后，气温由最热逐渐下降。"
        ],
        15 => [
            "name" => "处暑",
            "nameEn" => "the End of Heat ",
            "month" => 8,
            'c' => [
                20 => 23.95,
                21 => 23.13
            ],
            'diff' => [],
            "sanHou" => "鹰乃祭鸟、天地始肃、禾乃登。",
            "content" => "斗指戊。太阳黄经为150°。这时夏季火热已经到头了。暑气就要散了。它是温度下降的一个转折点。是气候变凉的象征，表示暑天终止。"
        ],
        16 => [
            "name" => "白露",
            "nameEn" => "White Dew",
            "month" => 9,
            'c' => [
                20 => 8.44,
                21 => 7.646
            ],
            'diff' => [
                1927 => 1
            ],
            "sanHou" => "鸿雁来、玄鸟归、群鸟养羞。",
            "content" => "斗指癸。太阳黄经为165°。天气转凉，地面水汽结露最多。"
        ],
        17 => [
            "name" => "秋分",
            "nameEn" => "the Autumn Equinox",
            "month" => 9,
            'c' => [
                20 => 28.822,
                21 => 23.042
            ],
            'diff' => [
                1942 => 1
            ],
            "sanHou" => "雷始收声、蛰虫培户、水始涸。",
            "content" => "斗指已。太阳黄经为180°。秋分这一天同春人一样，阳光几乎直射赤道，昼夜几乎相等。从这一天起，阳光直射位置继续由赤道向南半球推移，北半球开始昼短夜长。依我国旧历的秋季论，这一天刚好是秋季九十天的一半，因而称秋分。但在天文学上规定，北半球的秋天是从秋分开始的。"
        ],
        18 => [
            "name" => "寒露",
            "nameEn" => "Cold Dew",
            "month" => 10,
            'c' => [
                20 => 9.098,
                21 => 8.318
            ],
            'diff' => [],
            "sanHou" => "鸿雁来宾、雀攻大水为蛤、菊有黄花。",
            "content" => "斗指甲。太阳黄经为195°。白露后，天气转凉，开始出现露水，到了寒露，则露水日多，且气温更低了。所以，有人说，寒是露之气，先白而后寒，是气候将逐渐转冷的意思。而水气则凝成白色露珠。"
        ],
        19 => [
            "name" => "霜降",
            "nameEn" => "Frost\'s Descent",
            "month" => 10,
            'c' => [
                20 => 24.218,
                21 => 23.438
            ],
            'diff' => [
                2089 => 1
            ],
            "sanHou" => "豺乃祭兽、草木黄落、蛰虫咸俯。",
            "content" => "太阳黄经为210°。天气已冷，开始有霜冻了，所以叫霜降。"
        ],
        20 => [
            "name" => "立冬",
            "nameEn" => "the Beginning of Winter",
            "month" => 11,
            'c' => [
                20 => 8.218,
                21 => 7.438
            ],
            'diff' => [
                2089 => 1
            ],
            "sanHou" => "水始冰、地始冻、雉入大水为蜃。",
            "content" => "太阳黄经为225°。习惯上，我国人民把这一天当作冬季的开始。冬，作为终了之意，是指一年的田间操作结束了，作物收割之后要收藏起来的意思。立冬一过，我国黄河中、下游地区即将结冰，我国各地农民都将陆续地转入农田水利基本建设和其他农事活动中。"
        ],
        21 => [
            "name" => "小雪",
            "nameEn" => "Lesser Snow",
            "month" => 11,
            'c' => [
                20 => 23.08,
                21 => 23.36
            ],
            'diff' => [
                1978 => 1
            ],
            "sanHou" => "虹藏不见、天气上腾、闭塞而成冬。",
            "content" => "太阳黄经为240°。气温下降，开始降雪，但还不到大雪纷飞的时节，所以叫小雪。小雪前后，黄河流域开始降雪（南方降雪还要晚两个节气）；而北方，已进入封冻季节。"
        ],
        22 => [
            "name" => "大雪",
            "nameEn" => "Greater Snow",
            "month" => 12,
            'c' => [
                20 => 7.9,
                21 => 7.18
            ],
            'diff' => [
                1954 => 1
            ],
            "sanHou" => "鴠鸟不鸣、虎始交、荔挺生。",
            "content" => "太阳黄经为255°。大雪前后，黄河流域一带渐有积雪；而北方，已是“千里冰封，万里雪飘荡”的严冬了。"
        ],
        23 => [
            "name" => "冬至",
            "nameEn" => "the Winter Solstice",
            "month" => 12,
            'c' => [
                20 => 22.6,
                21 => 21.94
            ],
            'diff' => [
                1918 => -1,
                2021 => -1,
            ],
            "sanHou" => "蚯蚓结、麋角解、水泉动。",
            "content" => "太阳黄经为270°。冬至这一天，阳光几乎直射南回归线，我们北半球白昼最短，黑夜最长，开始进入数九寒天。天文学上规定这一天是北半球冬季的开始。而冬至以后，阳光直射位置逐渐向北移动，北半球的白天就逐渐长了，谚云：吃了冬至面，一天长一线。"
        ],
    ];

}